# ShadeDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..ShadeDepth Property
EnergyDataSettings Class See Also
---
Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double ShadeDepth { get; set; }
```

Visual Basic
---
```text
Public Property ShadeDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ShadeDepth {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The shade depth is less than zero. |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace